bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA16HVA.xml
<?xml version="1.0" encoding="UTF-8"?>
<part-description-file>
    <variants>
        <variant tempmin="0" tempmax="0" speedmax="0" package="" ordercode="standard" vccmin="1.8" vccmax="4.5"/>
    </variants>
    <devices>
        <device name="ATmega16HVA" architecture="AVR8" family="megaAVR">
            <address-spaces>
                <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x4000">
                    <memory-segment start="0x0000" size="0x4000" type="flash" rw="RW" exec="1" name="FLASH"
                                    pagesize="0x80"/>
                </address-space>
                <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                    <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
                </address-space>
                <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0001">
                    <memory-segment start="0" size="0x0001" type="fuses" rw="RW" exec="0" name="FUSES"/>
                </address-space>
                <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                    <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
                </address-space>
                <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0300">
                    <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                    <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
                    <memory-segment name="IRAM" start="0x0100" size="0x0200" type="ram" external="false"/>
                </address-space>
                <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0100">
                    <memory-segment start="0x0000" size="0x0100" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                    pagesize="0x04"/>
                </address-space>
                <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            </address-spaces>
            <peripherals>
                <module name="ADC">
                    <instance name="ADC" caption="Analog-to-Digital Converter">
                        <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"
                                        caption="Analog-to-Digital Converter"/>
                    </instance>
                </module>
                <module name="WDT">
                    <instance name="WDT" caption="Watchdog Timer">
                        <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                        caption="Watchdog Timer"/>
                    </instance>
                </module>
                <module name="BANDGAP">
                    <instance name="BANDGAP" caption="Bandgap">
                        <register-group name="BANDGAP" name-in-module="BANDGAP" offset="0x00" address-space="data"
                                        caption="Bandgap"/>
                    </instance>
                </module>
                <module name="EXINT">
                    <instance name="EXINT" caption="External Interrupts">
                        <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                        caption="External Interrupts"/>
                    </instance>
                </module>
                <module name="PORT">
                    <instance name="PORTC" caption="I/O Port">
                        <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTA" caption="I/O Port">
                        <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTB" caption="I/O Port">
                        <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                </module>
                <module name="FET">
                    <instance name="FET" caption="FET Control">
                        <register-group name="FET" name-in-module="FET" offset="0x00" address-space="data"
                                        caption="FET Control"/>
                    </instance>
                </module>
                <module name="SPI">
                    <instance name="SPI" caption="Serial Peripheral Interface">
                        <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data"
                                        caption="Serial Peripheral Interface"/>
                    </instance>
                </module>
                <module name="BOOT_LOAD">
                    <instance name="BOOT_LOAD" caption="Bootloader">
                        <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data"
                                        caption="Bootloader"/>
                    </instance>
                </module>
                <module name="CPU">
                    <instance name="CPU" caption="CPU Registers">
                        <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                        caption="CPU Registers"/>
                        <parameters>
                            <param name="CORE_VERSION" value="V2E"/>
                        </parameters>
                    </instance>
                </module>
                <module name="BATTERY_PROTECTION">
                    <instance name="BATTERY_PROTECTION" caption="Battery Protection">
                        <register-group name="BATTERY_PROTECTION" name-in-module="BATTERY_PROTECTION" offset="0x00"
                                        address-space="data" caption="Battery Protection"/>
                    </instance>
                </module>
                <module name="EEPROM">
                    <instance name="EEPROM" caption="EEPROM">
                        <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"
                                        caption="EEPROM"/>
                    </instance>
                </module>
                <module name="TC16">
                    <instance name="TC1" caption="Timer/Counter, 16-bit">
                        <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                    </instance>
