bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA16HVA.xml
                    <instance name="TC0" caption="Timer/Counter, 16-bit">
                        <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                    </instance>
                </module>
                <module name="COULOMB_COUNTER">
                    <instance name="COULOMB_COUNTER" caption="Coulomb Counter">
                        <register-group name="COULOMB_COUNTER" name-in-module="COULOMB_COUNTER" offset="0x00"
                                        address-space="data" caption="Coulomb Counter"/>
                    </instance>
                </module>
                <module name="VOLTAGE_REGULATOR">
                    <instance name="VOLTAGE_REGULATOR" caption="Voltage Regulator">
                        <register-group name="VOLTAGE_REGULATOR" name-in-module="VOLTAGE_REGULATOR" offset="0x00"
                                        address-space="data" caption="Voltage Regulator"/>
                    </instance>
                </module>
                <module name="FUSE">
                    <instance name="FUSE" caption="Fuses">
                        <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"
                                        caption="Fuses"/>
                    </instance>
                </module>
                <module name="LOCKBIT">
                    <instance name="LOCKBIT" caption="Lockbits">
                        <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"
                                        caption="Lockbits"/>
                    </instance>
                </module>
            </peripherals>


            <interrupts>
                <interrupt index="0" name="RESET"
                           caption="External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset"/>
                <interrupt index="1" name="BPINT" caption="Battery Protection Interrupt"/>
                <interrupt index="2" name="VREGMON" caption="Voltage regulator monitor interrupt"/>
                <interrupt index="3" name="INT0" caption="External Interrupt Request 0"/>
                <interrupt index="4" name="INT1" caption="External Interrupt Request 1"/>
                <interrupt index="5" name="INT2" caption="External Interrupt Request 2"/>
                <interrupt index="6" name="WDT" caption="Watchdog Timeout Interrupt"/>
                <interrupt index="7" name="TIMER1_IC" caption="Timer 1 Input capture"/>
                <interrupt index="8" name="TIMER1_COMPA" caption="Timer 1 Compare Match A"/>
                <interrupt index="9" name="TIMER1_COMPB" caption="Timer 1 Compare Match B"/>
                <interrupt index="10" name="TIMER1_OVF" caption="Timer 1 overflow"/>
                <interrupt index="11" name="TIMER0_IC" caption="Timer 0 Input Capture"/>
                <interrupt index="12" name="TIMER0_COMPA" caption="Timer 0 Comapre Match A"/>
                <interrupt index="13" name="TIMER0_COMPB" caption="Timer 0 Compare Match B"/>
                <interrupt index="14" name="TIMER0_OVF" caption="Timer 0 Overflow"/>
                <interrupt index="15" name="SPI_STC" caption="SPI Serial transfer complete"/>
                <interrupt index="16" name="VADC" caption="Voltage ADC Conversion Complete"/>
                <interrupt index="17" name="CCADC_CONV" caption="Coulomb Counter ADC Conversion Complete"/>
                <interrupt index="18" name="CCADC_REG_CUR" caption="Coloumb Counter ADC Regular Current"/>
                <interrupt index="19" name="CCADC_ACC" caption="Coloumb Counter ADC Accumulator"/>
                <interrupt index="20" name="EE_READY" caption="EEPROM Ready"/>
            </interrupts>
            <interfaces>
                <interface name="ISP" type="isp"/>
                <interface name="HVSP" type="hvsp"/>
                <interface name="debugWIRE" type="dw"/>
            </interfaces>
            <property-groups>
                <property-group name="SIGNATURES">
                    <property name="JTAGID" value="0x940C"/>
                    <property name="SIGNATURE0" value="0x1e"/>
                    <property name="SIGNATURE1" value="0x94"/>
                    <property name="SIGNATURE2" value="0x0c"/>
                </property-group>
                <property-group name="OCD">
                    <property name="OCD_REVISION" value="1"/>
                    <property name="OCD_DATAREG" value="0x31"/>
                    <property name="PROGBASE" value="0x0000"/>
                </property-group>
                <property-group name="JTAG_INTERFACE">
                    <property name="ALLOWFULLPAGESTREAM" value="0x00"/>
                </property-group>
                <property-group name="ISP_INTERFACE">
                    <property name="IspEnterProgMode_timeout" value="200"/>
                    <property name="IspEnterProgMode_stabDelay" value="100"/>
                    <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                    <property name="IspEnterProgMode_synchLoops" value="32"/>
                    <property name="IspEnterProgMode_byteDelay" value="0"/>
                    <property name="IspEnterProgMode_pollIndex" value="3"/>
                    <property name="IspEnterProgMode_pollValue" value="0x53"/>
                    <property name="IspLeaveProgMode_preDelay" value="1"/>
                    <property name="IspLeaveProgMode_postDelay" value="1"/>
                    <property name="IspChipErase_eraseDelay" value="20"/>
                    <property name="IspChipErase_pollMethod" value="1"/>
                    <property name="IspProgramFlash_mode" value="0x41"/>
                    <property name="IspProgramFlash_blockSize" value="128"/>
                    <property name="IspProgramFlash_delay" value="10"/>
                    <property name="IspProgramFlash_cmd1" value="0x40"/>
                    <property name="IspProgramFlash_cmd2" value="0x4C"/>
                    <property name="IspProgramFlash_cmd3" value="0x00"/>
                    <property name="IspProgramFlash_pollVal1" value="0x00"/>
                    <property name="IspProgramFlash_pollVal2" value="0x00"/>
                    <property name="IspProgramEeprom_mode" value="0x41"/>
                    <property name="IspProgramEeprom_blockSize" value="4"/>
                    <property name="IspProgramEeprom_delay" value="20"/>
                    <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                    <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                    <property name="IspProgramEeprom_cmd3" value="0x00"/>
                    <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                    <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                    <property name="IspReadFlash_blockSize" value="256"/>
                    <property name="IspReadEeprom_blockSize" value="256"/>
                    <property name="IspReadFuse_pollIndex" value="4"/>
                    <property name="IspReadLock_pollIndex" value="4"/>
                    <property name="IspReadSign_pollIndex" value="4"/>
                    <property name="IspReadOsccal_pollIndex" value="4"/>
                </property-group>
                <property-group name="HVSP_INTERFACE">
                    <property name="HvspControlStack"
                              value="0x4C 0x0C 0x1C 0x2C 0x3C 0x64 0x74 0x66 0x68 0x78 0x68 0x68 0x7A 0x6A 0x68 0x78 0x78 0x7D 0x6D 0x0C 0x80 0x40 0x20 0x10 0x11 0x08 0x04 0x02 0x03 0x08 0x04 0x0F"/>
                    <property name="HvspEnterProgMode_stabDelay" value="100"/>
                    <property name="HvspEnterProgMode_cmdexeDelay" value="0"/>
                    <property name="HvspEnterProgMode_synchCycles" value="6"/>
                    <property name="HvspEnterProgMode_latchCycles" value="1"/>
                    <property name="HvspEnterProgMode_toggleVtg" value="1"/>
                    <property name="HvspEnterProgMode_powoffDelay" value="25"/>
                    <property name="HvspEnterProgMode_resetDelay1" value="1"/>
                    <property name="HvspEnterProgMode_resetDelay2" value="70"/>
                    <property name="HvspLeaveProgMode_stabDelay" value="101"/>
                    <property name="HvspLeaveProgMode_resetDelay" value="26"/>
                    <property name="HvspChipErase_pollTimeout" value="40"/>
                    <property name="HvspChipErase_eraseTime" value="1"/>
                    <property name="HvspProgramFlash_mode" value="0x0D"/>
                    <property name="HvspProgramFlash_blockSize" value="256"/>
                    <property name="HvspProgramFlash_pollTimeout" value="6"/>
                    <property name="HvspReadFlash_blockSize" value="256"/>
                    <property name="HvspProgramEeprom_mode" value="0x05"/>
                    <property name="HvspProgramEeprom_blockSize" value="256"/>
                    <property name="HvspProgramEeprom_pollTimeout" value="5"/>
                    <property name="HvspReadEeprom_blockSize" value="256"/>
                    <property name="HvspProgramFuse_pollTimeout" value="25"/>
                    <property name="HvspProgramLock_pollTimeout" value="25"/>
                </property-group>
            </property-groups>
        </device>
    </devices>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="Fuses" name="FUSE">
                <register caption="" name="LOW" offset="0x00" size="1" initval="0xDF">
                    <bitfield caption="Watch-dog Timer always on" mask="0x80" name="WDTON"/>
                    <bitfield caption="Preserve EEPROM through the Chip Erase cycle" mask="0x40" name="EESAVE"/>
                    <bitfield caption="Serial program downloading (SPI) enabled" mask="0x20" name="SPIEN"/>
                    <bitfield caption="Debug Wire enable" mask="0x10" name="DWEN"/>
                    <bitfield caption="Self Programming enable" mask="0x08" name="SELFPRGEN"/>
                    <bitfield caption="Select start-up time" mask="0x07" name="SUT" values="ENUM_SUT"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_SUT">
                <value caption="Start-up time 6 CK/14 CK + 4 ms" name="6CK_14CK_4MS" value="0x00"/>
                <value caption="Start-up time 6 CK/14 CK + 8 ms" name="6CK_14CK_8MS" value="0x01"/>
                <value caption="Start-up time 6 CK/14 CK + 16 ms" name="6CK_14CK_16MS" value="0x02"/>
                <value caption="Start-up time 6 CK/14 CK + 32 ms" name="6CK_14CK_32MS" value="0x03"/>
                <value caption="Start-up time 6 CK/14 CK + 64 ms" name="6CK_14CK_64MS" value="0x04"/>
                <value caption="Start-up time 6 CK/14 CK + 128 ms" name="6CK_14CK_128MS" value="0x05"/>
                <value caption="Start-up time 6 CK/14 CK + 256 ms" name="6CK_14CK_256MS" value="0x06"/>
                <value caption="Start-up time 6 CK/14 CK + 512 ms" name="6CK_14CK_512MS" value="0x07"/>
            </value-group>
        </module>
